tutorials/impHybridPorousInterFoam/droplet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-3;

lx0 0;
ly0 0;
lz0 0;

lx1 6;
ly1 2.4;
lz1 0.1;

vertices
(
    ($lx0 $ly0 $lz0)    //0
    ($lx1 $ly0 $lz0)    //1
    ($lx1 $ly1 $lz0)    //2
    ($lx0 $ly1 $lz0)    //3
    ($lx0 $ly0 $lz1)    //4
    ($lx1 $ly0 $lz1)    //5
    ($lx1 $ly1 $lz1)    //6
    ($lx0 $ly1 $lz1)    //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (480 192 1) simpleGrading (1 1 1)
);


edges
(
);


boundary
(
    top   
    {
        type patch;
        faces
        (
            (3 7 6 2)

        );
    }

    bottom  
    {
        type patch;
        faces
        (
            (0 4 5 1)

        );
    }

    left
    {
        type cyclic;
        neighbourPatch  right;
        faces
        (
            (0 3 7 4)
        );
    }

    right
    {
        type cyclic;
        neighbourPatch  left;
        faces
        (
            (1 2 6 5)
        );
    }


    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
