tutorials/impHybridPorousInterFoam/droplet/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.wetting 0
    volScalarFieldValue eps 1
);

regions
(
    boxToCell
    {
        box (0 0 0) (1 0.2e-3 1);
        fieldValues
        (
            volScalarFieldValue eps 0.01
            volScalarFieldValue alpha.wetting 1
        );
    }

    cylinderToCell
    {
        p1 (3e-3 0.2e-3 -1);
        p2 (3e-3 0.2e-3 1);
        radius 0.7e-3;  
        fieldValues
        (
            volScalarFieldValue alpha.wetting 1
        );
    }
);


// ************************************************************************* //
